app/views/users/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	<% @posts.each do |p| %>
		Name : <%= p.user.firstname %>