app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hey every one "], ["user_id", 1], ["created_at", "2017-07-18 08:24:06.255757"], ["updated_at", "2017-07-18 08:24:06.255757"]]
---
	def create
		@post = current_user.posts.build(post_params)
		if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND (1) LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
	def destroy
		@post = current_user.posts.find_by(params[:id])
		@post.destroy