app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "ashish118"], ["LIMIT", 1]]
---
	def create_session

		@user = User.find_by(username: params[:username] )